{
  "app": {
    "Home": {
        "greeting": "Merhaba, ben Zumar Awan",
        "title": "Yazılım Mühendisi | Yaratıcı Düşünür ve Problem Çözücü",
        "subtitle": "Konseptten Koda - İşletmenizi Yükseltmek İçin Etkili Yazılım Mühendisliği Mükemmelliği Sunma",
        "book_a_call": "Görüşme Ayarla"
      },
    "WhatIDo": {
      "title": "< Ne yaparım? />",
      "subtitle": "Sözleşmeli projeler için kod yazmayı ve şirketlerin işlerini genişletmelerine yardımcı olmayı seviyorum.🤜🤛",
      "techExpertise": "Teknik uzmanlıklarım aşağıdaki gibidir:",
      "FullStackDev": {
        "skillName": "Full-stack Web Geliştirme",
        "descriptionArr": [
          "React.js, Next.js, Redux.js, Angular, TailwindCSS, Material-UI, HTML/CSS ve Bootstrap kullanarak duyarlı tek sayfa web uygulamaları ön yüzü geliştirme.",
          "Node.js ve Express.js kullanarak uygulama için güvenli ve hızlı arka uçlar oluşturma.",
          "Sırasıyla Mongoose, Sequelize ve Prisma gibi ODM/ORM'ler kullanarak MongoDB, MySQL, PostgreSQL gibi veritabanlarıyla etkileşim kurma.",
          "Gelişmiş kod kalitesi, sürdürülebilirlik ve ölçeklenebilirlik ile hem ön uç hem de arka uç uygulamaları geliştirmek için statik tipleme gibi güçlü özellikleri için TypeScript'i kullanma.",
          "RESTful API'ler geliştirme ve tüketme, entegrasyonu sağlamak için modern programlama uygulamalarını kullanma."
        ]
      }
    },
    "Education": {
      "title": "Eğitim",
      "subtitle": "Niteliklerim ve Sertifikalarım",
      "description": "Akademik geçmişim hakkında bilmeniz gerekenler burada 🙃",
      "aboutDegree": "Derece Hakkında",
      "aboutCourses": "Kurslar Hakkında",
      "coursesDescription": "En son teknolojilerle güncel kalmak için çevrimiçi kurslar ve sertifikalar aracılığıyla sürekli öğrenme",
      "onsiteCourses": "Yerinde Kurslar",
      "certificate": "Sertifikalar",
      "noOnsiteCourses": "Henüz yerinde kurs yok.",
      "noRemoteCertificates": "Henüz uzaktan sertifika yok.",
      "viewCertificate": "Sertifikayı Görüntüle",
      "visitInstitution": "Kurumu Ziyaret Et",
      "viewAllCertificates": "Tüm Sertifikaları Görüntüle",
      "allCertificates": "Tüm Sertifikalar",
      "browseCertificates": "Tüm sertifikalarıma ve kurslarıma göz atın",
      "close": "Kapat",
      "clickToViewDetails": "Ayrıntıları görüntülemek için tıklayın",
      "education": [
        {
          "degree": "Bilgisayar Bilimleri Lisans Derecesi",
          "institution": "Pakistan Sanal Üniversitesi",
          "location": "Lahor, Pakistan",
          "date": "2021 - 2025",
          "details": [
            "⚡ Programlama temelleri, algoritmalar ve yazılım geliştirmeyi kapsayan kapsamlı Bilgisayar Bilimleri müfredatını tamamladı.",
            "⚡ Nesne yönelimli programlama, veri yapıları ve veritabanı yönetiminde güçlü bir temel geliştirdi.",
            "⚡ Çevrimiçi öğrenme ortamına katılarak öz disiplin ve zaman yönetimi becerilerini geliştirdi.",
            "⚡ Pratik kodlama yeteneklerini güçlendirmek için çeşitli programlama projeleri ve ödevleri tamamladı.",
            "⚡ Modern geliştirme araçları ve işbirlikçi yazılım geliştirme uygulamalarıyla deneyim kazandı."
          ]
        }
      ],
      "certificates": [
        {
          "name": "İleri Düzey Web Geliştirme",
          "issuer": "Lite College",
          "date": "22/08/2022 - 22/03/2023",
          "description": [
            "- Derinlemesine bir Ön Uç Web Geliştirme kursunu tamamladı.",
            "- HTML, CSS, JavaScript ve Bootstrap'i kapsıyordu.",
            "- Duyarlı kullanıcı arayüzleri ve etkileşimli özellikler oluşturdu.",
            "- Birden çok gerçek dünya projesi aracılığıyla uygulamalı deneyim kazandı."
          ],
          "mode": "onsite"
        },
        {
          "name": "Full Stack Web Geliştirme",
          "issuer": "Corvit Systems",
          "date": "02/10/2023 - 23/02/2023",
          "description": [
            "- MERN yığınını kullanan Full Stack geliştirme eğitimi.",
            "- CRUD işlevselliğine sahip eksiksiz web uygulamaları oluşturdu.",
            "- REST API'leri, kimlik doğrulama ve yönlendirme uygulandı.",
            "- Git ve sürüm kontrolü en iyi uygulamalarını kullanarak projeleri dağıttı."
          ],
          "mode": "onsite"
        },
        {
          "name": "AWS Bulut Bilişim",
          "issuer": "Corvit Systems",
          "date": "15/07/2024 - 14/10/2024",
          "description": [
            "- EC2, S3, Lambda ve RDS dahil olmak üzere temel AWS hizmetlerini kapsadı.",
            "- Bulut altyapısı, dağıtım ve izlemede uygulamalı laboratuvarlar.",
            "- AWS araçlarını kullanarak gerçek zamanlı ölçeklendirme ve otomasyon uygulandı.",
            "- Uygun maliyetli, güvenli ve ölçeklenebilir mimarilere odaklanıldı."
          ],
          "mode": "onsite"
        },
        {
          "name": "MERN Stack Geliştirici Stajı",
          "issuer": "Tiers Limited",
          "date": "24/06/2024 - 24/08/2024",
          "description": [
            "- MERN Stack Geliştiricisi olarak 2 aylık bir stajı tamamladı.",
            "- MongoDB, Express, React ve Node.js kullanarak ölçeklenebilir web uygulamaları oluşturdu ve sürdürdü.",
            "- Git, Trello ve Agile metodolojisini kullanarak uzak bir ekipte işbirliği yaptı.",
            "- Performans optimizasyonu, yeniden kullanılabilir bileşen tasarımı ve API entegrasyonuna odaklanıldı."
          ],
          "mode": "remote"
        },
        {
          "name": "CPA: C++'da Programlama Esasları",
          "issuer": "Cisco Networking Academy / C++ Institute",
          "date": "5 Eyl 2023",
          "description": [
            "- C++'da Programlama Esasları sertifikasını tamamladı.",
            "- C++ sözdizimi, OOP, bellek yönetimi ve algoritmalar hakkında bilgi edindi.",
            "- Konsol tabanlı uygulamalar ve problem çözme becerileri geliştirdi.",
            "- Cisco Networking Academy ve C++ Institute tarafından ortaklaşa verilen kimlik bilgisi."
          ],
          "mode": "remote"
        },
        {
          "name": "Temel Eğitim Programı - Web Geliştirme",
          "issuer": "SeeBiz Pvt Ltd",
          "date": "31/06/2023 - 31/07/2024",
          "description": [
            "- Web geliştirmede 1 yıllık yapılandırılmış bir eğitim programını tamamladı.",
            "- Temel web teknolojilerini kapsadı: HTML5, CSS3, JavaScript (ES6+) ve duyarlı tasarım.",
            "- Gerçek zamanlı işbirliği ve Agile tabanlı iş akışına maruz kaldı.",
            "- Dahili araçlar üzerinde çalıştı ve kod incelemelerine ve hata ayıklama oturumlarına katıldı.",
            "- Günlük pratikte Git, GitHub ve sürüm kontrolü uygulandı.",
            "- Mini projeler oluşturdu ve şirket içi geliştirme görevlerine katkıda bulundu."
          ],
          "mode": ""
        },
        {
          "name": "MERN Stack Yoğun Eğitim Programı",
          "issuer": "Boltech Solutions",
          "date": "1/07/2024 - 1/10/2024",
          "description": [
            "- 3 aylık yoğun bir MERN yığını yoğun eğitim programını başarıyla tamamladı.",
            "- MongoDB, Express.js, React.js ve Node.js ile uygulamalı deneyim kazandı.",
            "- Kimlik doğrulama, yönlendirme ve CRUD özelliklerine sahip tam yığın projeler geliştirdi.",
            "- Canlı oturumlara, haftalık zorluklara ve gerçek dünya ödevlerine katıldı.",
            "- Git, GitHub Projeleri ve akran kodu incelemelerini kullanarak gruplar halinde işbirliği yaptı.",
            "- Üretim benzeri bir ortamda tam yığın konseptlerini entegre eden bir bitirme projesi oluşturdu."
          ],
          "mode": ""
        }
      ]
    },
    "Experience": {
      "title": "Deneyim",
      "subtitle": "İş, Staj ve Gönüllülük",
      "description": "Kodla yaratıcı çözümler üretmeyi seven tutkulu bir yazılım mühendisiyim. Ana uzmanlık alanım, MERN yığınını kullanarak ölçeklenebilir uygulamalar oluşturmak etrafında dönüyor. Ek olarak, teknoloji topluluklarını geliştirmeye yönelik güçlü bir hevesim var ve çeşitli teknoloji etkinliklerine aktif olarak katılıyorum. Kariyer yollarına başlarken gelecek vadeden geliştiricilere rehberlik etmek ve onları desteklemek bana büyük bir neşe veriyor çünkü hepimiz eksik noktalı virgülü bulma mücadelesini biliyoruz.",
      "experiences": [
        {
          "title": "Jr Yazılım Geliştirici",
          "company": "AiGROS Tech",
          "date": "11/2024 – Halen",
          "mode": "Hibrit",
          "details": [
            "Verimlilik ve kullanılabilirlik için web uygulamaları geliştirme ve geliştirme.",
            "Sorunsuz kullanıcı deneyimi sağlamak için ekiple işbirliği yapma.",
            "Ön uç ve arka uç teknolojilerinde beceriler geliştirme."
          ]
        },
        {
          "title": "Yeni Mezunlar Yoğun Eğitim Programı",
          "company": "BolTech Solutions",
          "date": "07/2024 – 10/2024",
          "mode": "Yerinde",
          "details": [
            "- MERN Yığını geliştirmeye odaklanan 2 aylık bir yoğun eğitim programını tamamladı.",
            "- React profesyonelleriyle birlikte gerçek dünya projeleri üzerinde çalıştı."
          ]
        },
        {
          "title": "Yazılım Mühendisi Stajyeri",
          "company": "Secliz Pvt Ltd",
          "date": "06/2023 – 07/2024",
          "mode": "Yerinde",
          "details": [
            "- Kıdemli mentorluk altında 1 yıllık Tam Yığın eğitimini tamamladı.",
            "- Birkaç proje üzerinde çalıştı (portföyde belirtilmiştir).",
            "- Angular, React JS ve Node.js kullanarak dinamik web uygulamaları oluşturdu."
          ]
        }
      ]
    },
    "Projects": {
      "title": "Öne Çıkan Çalışmalar",
      "subtitle": "Modern teknolojilerle oluşturulmuş müşteri ve şirket projeleri aracılığıyla yeniliği sergilemek.",
      "BestConnectClient": {
        "title": "Best Connect Müşteri Uygulaması",
        "role": "Ön Uç Geliştirici"
      },
      "BestConnectAdmin": {
        "title": "Best Connect Yönetici Uygulaması",
        "role": "Ön Uç Geliştirici"
      },
      "WeSparkle": {
        "title": "We Sparkle",
        "role": "Ön Uç Geliştirici"
      },
      "MedConnect": {
        "title": "Med Connect",
        "role": "Ön Uç Geliştirici"
      },
      "TelecomProjects": {
        "title": "Telekom Projeleri 1+",
        "role": "Ön Uç Geliştirici"
      },
      "Portfolio": {
        "title": "Portföy Web Sitesi",
        "role": "Ön Uç Geliştirici"
      }
    }
  }
} 