{
  "app": {
    "Home": {
      "greeting": "سلام، میں زمر اعوان ہوں",
      "title": "سافٹ ویئر انجینئر | تخلیقی سوچ رکھنے والا اور مسئلہ حل کرنے والا",
      "subtitle": "تصور سے کوڈ تک - آپ کے کاروبار کو بہتر بنانے کے لیے موثر سافٹ ویئر انجینئرنگ فراہم کرنا",
      "book_a_call": "کال بک کریں"
    },
    "WhatIDo": {
      "title": "< میں کیا کرتا ہوں؟ />",
      "subtitle": "مجھے کنٹریکٹ پر مبنی پروجیکٹس کے لیے کوڈ کرنا اور کمپنیوں کو اپنے کاروبار کو وسعت دینے میں مدد کرنا پسند ہے۔🤜🤛",
      "techExpertise": "میری تکنیکی مہارتیں درج ذیل ہیں:",
      "FullStackDev": {
        "skillName": "فل اسٹیک ویب ڈویلپمنٹ",
        "descriptionArr": [
          "ری ایکٹ، نیکسٹ، ریڈکس، اینگولر، ٹیل ونڈ، میٹریل یو آئی، ایچ ٹی ایم ایل/سی ایس ایس اور بوٹسٹریپ کا استعمال کرتے ہوئے ریسپانسیو سنگل پیج ویب ایپلی کیشنز بنانا۔",
          "نوڈ جے ایس اور ایکسپریس جے ایس کا استعمال کرتے ہوئے ایپلی کیشن کے لیے محفوظ اور تیز بیک اینڈ بنانا۔",
          "مونگو ڈی بی، مائی ایس کیو ایل، پوسٹگری ایس کیو ایل جیسے ڈیٹا بیس سے او ڈی ایمز/او آر ایمز جیسے مونگوس، سکوئلائز اور پرزما کے ذریعے انٹرایکٹ کرنا۔",
          "ٹائپ اسکرپٹ کی طاقتور خصوصیات جیسے اسٹیٹک ٹائپنگ وغیرہ کا استعمال کرتے ہوئے فرنٹ اینڈ اور بیک اینڈ ایپلی کیشنز کو اعلیٰ کوڈ کوالٹی، مینٹی نیبلٹی اور اسکیل ایبلٹی کے ساتھ تیار کرنا۔",
          "RESTful APIs کو تیار کرنا اور استعمال کرنا، جدید پروگرامنگ پریکٹسز کے ساتھ انٹیگریشن کو یقینی بنانا۔"
        ]
      }
    },
    "Education": {
      "title": "تعلیم",
      "subtitle": "میری قابلیتیں اور سرٹیفیکیشنز",
      "description": "میری تعلیمی پس منظر کے بارے میں آپ کو جاننے کی ضرورت ہے 🙃",
      "aboutDegree": "ڈگری کے بارے میں",
      "aboutCourses": "کورسز کے بارے میں",
      "coursesDescription": "جدید ترین ٹیکنالوجیز کے ساتھ اپ ڈیٹ رہنے کے لیے آن لائن کورسز اور سرٹیفیکیشنز کے ذریعے مسلسل سیکھنا",
      "onsiteCourses": "آن سائٹ کورسز",
      "certificate": "سرٹیفیکیشنز",
      "noOnsiteCourses": "ابھی تک کوئی آن سائٹ کورس نہیں۔",
      "noRemoteCertificates": "ابھی تک کوئی ریموٹ سرٹیفیکیشن نہیں۔",
      "viewCertificate": "سرٹیفیکیشن دیکھیں",
      "visitInstitution": "ادارہ ملاحظہ کریں",
      "viewAllCertificates": "تمام سرٹیفیکیشنز دیکھیں",
      "allCertificates": "تمام سرٹیفیکیشنز",
      "browseCertificates": "میری تمام سرٹیفیکیشنز اور کورسز کو براؤز کریں",
      "close": "بند کریں",
      "clickToViewDetails": "تفصیلات دیکھنے کے لیے کلک کریں",
      "education": [
        {
          "degree": "کمپیوٹر سائنس میں بیچلر آف سائنس",
          "institution": "ورچوئل یونیورسٹی آف پاکستان",
          "location": "لاہور، پاکستان",
          "date": "2021 - 2025",
          "details": [
            "⚡ پروگرامنگ کے بنیادی اصولوں، الگورتھمز، اور سافٹ ویئر ڈویلپمنٹ کو شامل کرتے ہوئے جامع کمپیوٹر سائنس نصاب مکمل کیا۔",
            "⚡ آبجیکٹ اورینٹڈ پروگرامنگ، ڈیٹا سٹرکچرز، اور ڈیٹا بیس مینجمنٹ میں مضبوط بنیاد تیار کی۔",
            "⚡ آن لائن سیکھنے کے ماحول میں حصہ لیا، خود نظم و ضبط اور وقت کی مینجمنٹ کی مہارتوں کو بہتر بنایا۔",
            "⚡ عملی کوڈنگ کی صلاحیتوں کو مضبوط بنانے کے لیے مختلف پروگرامنگ پروجیکٹس اور اسائنمنٹس مکمل کیے۔",
            "⚡ جدید ڈویلپمنٹ ٹولز اور تعاون پر مبنی سافٹ ویئر ڈویلپمنٹ پریکٹس کے ساتھ تجربہ حاصل کیا۔"
          ]
        }
      ],
      "certificates": [
        {
          "name": "ایڈوانس ویب ڈویلپمنٹ",
          "issuer": "لائٹ کالج",
          "date": "22/08/2022 - 22/03/2023",
          "description": [
            "- گہری فرنٹ اینڈ ویب ڈویلپمنٹ کورس مکمل کیا۔",
            "- HTML، CSS، JavaScript، اور Bootstrap کا احاطہ کیا۔",
            "- ریسپانسیو UIs اور انٹرایکٹو فیچرز بنائے۔",
            "- متعدد حقیقی دنیا کے پروجیکٹس کے ذریعے عملی تجربہ حاصل کیا۔"
          ],
          "mode": "onsite"
        },
        {
          "name": "فل اسٹیک ویب ڈویلپمنٹ",
          "issuer": "کورویٹ سسٹمز",
          "date": "02/10/2023 - 23/02/2023",
          "description": [
            "- MERN اسٹیک کا استعمال کرتے ہوئے فل اسٹیک ڈویلپمنٹ تربیت۔",
            "- CRUD فنکشنلٹی کے ساتھ مکمل ویب ایپلی کیشنز بنائیں۔",
            "- REST APIs، authentication، اور routing کو لاگو کیا۔",
            "- Git اور version control کی بہترین پریکٹس کے ساتھ پروجیکٹس کو deploy کیا۔"
          ],
          "mode": "onsite"
        },
        {
          "name": "AWS کلاؤڈ کمپیوٹنگ",
          "issuer": "کورویٹ سسٹمز",
          "date": "15/07/2024 - 14/10/2024",
          "description": [
            "- EC2، S3، Lambda، اور RDS سمیت بنیادی AWS سروسز کا احاطہ کیا۔",
            "- کلاؤڈ انفراسٹرکچر، deployment، اور monitoring میں عملی لیبز۔",
            "- AWS ٹولز کا استعمال کرتے ہوئے real-time scaling اور automation کو لاگو کیا۔",
            "- cost-effective، محفوظ، اور scalable architectures پر توجہ مرکوز۔"
          ],
          "mode": "onsite"
        },
        {
          "name": "MERN اسٹیک ڈویلپر انٹرن شپ",
          "issuer": "ٹیئرز لمیٹڈ",
          "date": "24/06/2024 - 24/08/2024",
          "description": [
            "- MERN اسٹیک ڈویلپر کے طور پر 2 ماہ کی انٹرن شپ مکمل کی۔",
            "- MongoDB، Express، React، اور Node.js کا استعمال کرتے ہوئے scalable ویب ایپلی کیشنز بنائیں اور برقرار رکھیں۔",
            "- Git، Trello، اور Agile methodology کا استعمال کرتے ہوئے ریموٹ ٹیم میں تعاون کیا۔",
            "- performance optimization، reusable component design، اور API integration پر توجہ مرکوز۔"
          ],
          "mode": "remote"
        },
        {
          "name": "CPA: C++ میں پروگرامنگ کے بنیادی اصول",
          "issuer": "سسکو نیٹ ورکنگ اکیڈمی / C++ انسٹیٹیوٹ",
          "date": "5 ستمبر 2023",
          "description": [
            "- C++ میں پروگرامنگ کے بنیادی اصولوں کی سرٹیفیکیشن مکمل کی۔",
            "- C++ syntax، OOP، memory handling، اور الگورتھمز کی سمجھ حاصل کی۔",
            "- console-based ایپلی کیشنز اور problem-solving کی مہارتیں تیار کیں۔",
            "- سسکو نیٹ ورکنگ اکیڈمی اور C++ انسٹیٹیوٹ کے مشترکہ طور پر جاری کردہ credential۔"
          ],
          "mode": "remote"
        },
        {
          "name": "بنیادی تربیتی پروگرام - ویب ڈویلپمنٹ",
          "issuer": "سی بیز پرائیویٹ لمیٹڈ",
          "date": "31/06/2023 - 31/07/2024",
          "description": [
            "- ویب ڈویلپمنٹ میں 1 سال کا structured تربیتی پروگرام مکمل کیا۔",
            "- بنیادی ویب ٹیکنالوجیز: HTML5، CSS3، JavaScript (ES6+)، اور responsive design کا احاطہ کیا۔",
            "- real-time collaboration اور Agile-based workflow کا تجربہ حاصل کیا۔",
            "- internal tools پر کام کیا اور code reviews اور debugging sessions میں حصہ لیا۔",
            "- Git، GitHub، اور version control کو daily practice میں لاگو کیا۔",
            "- mini-projects بنائے اور in-house development tasks میں حصہ لیا۔"
          ],
          "mode": ""
        },
        {
          "name": "MERN اسٹیک بوٹ کیمپ",
          "issuer": "بولٹیک سولوشنز",
          "date": "1/07/2024 - 1/10/2024",
          "description": [
            "- 3 ماہ کا intensive MERN stack بوٹ کیمپ کامیابی سے مکمل کیا۔",
            "- MongoDB، Express.js، React.js، اور Node.js کے ساتھ عملی تجربہ حاصل کیا۔",
            "- authentication، routing، اور CRUD features کے ساتھ full-stack پروجیکٹس تیار کیے۔",
            "- live sessions، weekly challenges، اور real-world assignments میں شرکت کی۔",
            "- Git، GitHub Projects، اور peer code reviews کے ساتھ groups میں تعاون کیا۔",
            "- production-like environment میں full-stack concepts کو integrate کرتے ہوئے capstone project بنایا۔"
          ],
          "mode": ""
        }
      ]
    },
    "Experience": {
      "title": "تجربہ",
      "subtitle": "کام، انٹرن شپ اور رضاکارانہ خدمات",
      "description": "میں ایک پرجوش سافٹ ویئر انجینئر ہوں جو کوڈ کے ساتھ تخلیقی حل بنانے سے محبت کرتا ہے۔ میری مہارت کا مرکزی علاقہ MERN اسٹیک کا استعمال کرتے ہوئے اسکیل ایبل ایپلی کیشنز بنانا ہے۔ اس کے علاوہ، مجھے ٹیک کمیونٹیز کو فروغ دینے کا شدید شوق ہے اور میں مختلف ٹیک ایونٹس میں فعال طور پر حصہ لیتا ہوں۔ نئے ڈویلپرز کی رہنمائی اور ان کی مدد کرنا جب وہ اپنے کیریئر کا آغاز کرتے ہیں مجھے بہت خوشی دیتا ہے کیونکہ ہم سب جانتے ہیں کہ گمشدہ سیمی کولن تلاش کرنے کی جدوجہد کیا ہوتی ہے۔",
      "experiences": [
        {
          "title": "جونیئر سافٹ ویئر ڈویلپر",
          "company": "AiGROS Tech",
          "date": "11/2024 – موجودہ",
          "mode": "ہائبرڈ",
          "details": [
            "کارکردگی اور استعمال میں آسانی کے لیے ویب ایپلی کیشنز کو تیار اور بہتر بنانا۔",
            "بہتر صارف تجربے کو یقینی بنانے کے لیے ٹیم کے ساتھ تعاون کرنا۔",
            "فرنٹ اینڈ اور بیک اینڈ ٹیکنالوجیز میں مہارتیں بنانا۔"
          ]
        },
        {
          "title": "فریش گریجویٹس بوٹ کیمپ",
          "company": "BolTech Solutions",
          "date": "07/2024 – 10/2024",
          "mode": "آن سائٹ",
          "details": [
            "MERN اسٹیک ڈویلپمنٹ پر مرکوز 2 ماہ کا بوٹ کیمپ مکمل کیا۔",
            "ری ایکٹ پیشہ ور افراد کے ساتھ حقیقی دنیا کے پروجیکٹس پر کام کیا۔"
          ]
        },
        {
          "title": "سافٹ ویئر انجینئر ٹرینی",
          "company": "Secliz Pvt Ltd",
          "date": "06/2023 – 07/2024",
          "mode": "آن سائٹ",
          "details": [
            "سینئر رہنمائی کے تحت 1 سال کی فل اسٹیک تربیت مکمل کی۔",
            "پورٹ فولیو میں ذکر کردہ کئی پروجیکٹس پر کام کیا۔",
            "Angular، React JS اور Node.js کا استعمال کرتے ہوئے متحرک ویب ایپس بنائیں۔"
          ]
        }
      ]
    },
    "Projects": {
      "title": "نمایاں کام",
      "subtitle": "جدید ٹیکنالوجیز کے ساتھ بنائے گئے کلائنٹ اور کمپنی پروجیکٹس کی نمائش۔",
      "BestConnectClient": {
        "title": "بیسٹ کنیکٹ کلائنٹ ایپ",
        "role": "فرنٹ اینڈ ڈویلپر"
      },
      "BestConnectAdmin": {
        "title": "بیسٹ کنیکٹ ایڈمن ایپ",
        "role": "فرنٹ اینڈ ڈویلپر"
      },
      "WeSparkle": {
        "title": "وی اسپارکل",
        "role": "فرنٹ اینڈ ڈویلپر"
      },
      "MedConnect": {
        "title": "میڈ کنیکٹ",
        "role": "فرنٹ اینڈ ڈویلپر"
      },
      "TelecomProjects": {
        "title": "ٹیلی کام پروجیکٹس 1+",
        "role": "فرنٹ اینڈ ڈویلپر"
      },
      "Portfolio": {
        "title": "پورٹ فولیو ویب سائٹ",
        "role": "فرنٹ اینڈ ڈویلپر"
      }
    },
    "Contact": {
      "title": "رابطہ کریں",
      "subtitle": "مجھ سے رابطہ کریں",
      "description": "کیا آپ کے پاس کوئی سوال، پروجیکٹ آئیڈیا یا تعاون کی تجویز ہے؟ نیچے دیا گیا فارم پُر کریں یا براہ راست ای میل کے ذریعے رابطہ کریں۔ میں جلد از جلد آپ کو جواب دوں گا!",
      "form": {
        "name": "آپ کا نام",
        "email": "آپ کا ای میل ایڈریس",
        "message": "آپ کا پیغام",
        "send": "بھیجیں",
        "sending": "بھیجا جا رہا ہے...",
        "success": "آپ کا پیغام کامیابی سے بھیج دیا گیا ہے!",
        "error": "ایک خرابی پیش آگئی ہے۔ براہ کرم دوبارہ کوشش کریں۔"
      },
      "reachout": "آپ نیچے دیے گئے سوشل میڈیا اکاؤنٹس کے ذریعے بھی مجھ سے رابطہ کر سکتے ہیں:",
      "email": "ای میل",
      "phone": "فون"
    }
  }
}
